{
  "title": "<span class='nowrap'>Detecting Deepfake Talking Heads</span><br><span class='nowrap'>from Facial Biometric Anomalies</span>",
  "subtitle": "",
  "authors": [
    {
      "name": "Justin D. Norman",
      "affiliation": "University of California, Berkeley",
      "website": "https://justintime.ai",
      "email": "justin.norman@berkeley.edu"
    },
    {
      "name": "Hany Farid",
      "affiliation": "University of California, Berkeley",
      "website": "https://farid.berkeley.edu/",
      "email": "hfarid@berkeley.edu"
    }
  ],
  "abstract": "A combination of highly realistic voice cloning, along with visually compelling avatar, face-swap, or lip-sync deepfake video generation, makes it relatively easy to create a video of anyone saying anything. Such deepfake impersonations are being used to power frauds, scams, and political disinformation. We describe a forensic technique for detecting deepfake video impersonations that leverages unnatural patterns in facial biometrics. We evaluate this technique across a large dataset of deepfake impersonations and assess its reliability to video laundering and its generalization to previously unseen video deepfake generators.",
  "venue": "arXiv preprint",
  "publicationDate": "2025-07-11",
  "doi": "",
  "arxivId": "2507.08917",
  "pdfUrl": "https://arxiv.org/pdf/2507.08917",
  "codeUrl": "",
  "bibtex": "@article{norman2025detecting,\n  title={Detecting Deepfake Talking Heads from Facial Biometric Anomalies},\n  author={Norman, Justin D and Farid, Hany},\n  journal={arXiv preprint arXiv:2507.08917},\n  year={2025}\n}",
  "keyContributions": [
    "Novel identity-agnostic forensic technique that leverages facial biometric anomalies without requiring external references",
    "Simple and lightweight model architecture with 94.9% accuracy that can be easily deployed at the edge for real-time detection",
    "Robust performance against video laundering and generalization to previously unseen deepfake generators"
  ],
  "datasetUrl": "",
  "supplementaryUrl": "",
  "slidesUrl": ""
}